Repository: in2code-de/in2publish_core
Catalog: Resources/Private/Language/*.locallang.testing.xlf
Languages: de

# test_skipped
source: The test %s was skipped because other tests failed or were skipped.
de: Der Test %s wurde übersprungen, weil andere Tests fehlschlugen oder übersprungen wurden.

# dependency_failed
source: Following dependencies failed:
de: Folgende Tests schlugen fehl:

# dependency_skipped
source: Following dependencies skipped:
de: Folgende Tests wurden übersprungen:

# configuration.options_valid
source: The tested configuration options are valid.
de: Die getesteten Konfigurationsoptionen sind gültig.

# configuration.options_invalid
source: Some tested configuration options are invalid.
de: Einige der getesteten Konfigurationsoptionen sind ungültig.

# configuration.breadcrumb_and_disable_parents_active
source: view.record.breadcrumb and debug.disableParentRecords are both enabled. Breadcrumbs will not be displayed correctly.
de: view.record.breadcrumb und debug.disableParentRecords sind beide aktiviert. Breadcrumbs werden nicht korrekt dargestellt.

# configuration.format_okay
source: The configuration file is well formatted and holds all required options.
de: Die Konfiguration ist gültig formatiert und enthält alle Optionen.

# configuration.format_error
source: One or more options are not configured correctly.
de: Eine oder mehrere Optionen sind nicht korrekt konfiguriert.

# configuration.foreign_format_okay
source: The foreign configuration file is well formatted and holds all required options.
de: Die Konfiguration auf dem entfernten System is gültig formatiert und enthält alle Optionen.

# configuration.foreign_format_test_exec_error
source: The configuration test on foreign could not be executed.
de: Beim testen der Konfiguration auf dem entfernten System ist ein Fehler aufgetreten.

# configuration.foreign_format_error
source: One or more options on foreign are not configured correctly.
de: Eine oder mehrere Optionen auf dem entfernten System sind nicht korrekt konfiguriert.

# database.missing_important_tables
source: These tables are missing:
de: Diese Tabellen fehlen:

# database.local_accessible_and_tables_present
source: The local database is accessible and contains all required tables.
de: Die lokale Datenbank ist erreichbar und enthält alle notwendigen Tabellen.

# database.local_inaccessible
source: The local database is inaccessible.
de: Es kann nicht auf die lokale Datenbank zugegriffen werden.

# database.local_offline
source: The local database seems to be offline.
de: Die lokale Datenbank scheint offline zu sein.

# database.local_tables_missing
source: The local database misses important tables.
de: In der lokalen Datenbank fehlen wichtige Tabellen.

# database.foreign_accessible_and_tables_present
source: The foreign database is accessible and contains all required tables.
de: Die entfernte Datenbank ist erreichbar und enthält alle notwendigen Tabellen.

# database.foreign_inaccessible
source: The foreign database is inaccessible.
de: Es kann nicht auf die entfernte Datenbank zugegriffen werden.

# database.foreign_offline
source: The foreign database seems to be offline.
de: Die entfernte Datenbank scheint offline zu sein.

# database.foreign_tables_missing
source: The foreign database misses important tables.
de: In der entfernte Datenbank fehlen wichtige Tabellen.

# database.local_and_foreign_identical
source: The local database is the same as the foreign database.
de: Die lokale datenbank ist die gleiche wie die entfernte datenbank.

# database.no_differences
source: The schema of the local and foreign database is identical.
de: Das Schema der lokalen und entfernten Datenbank ist identisch.

# database.tables_missing_on_other_side
source: The databases have different tables.
de: Die Datenbanken haben unterschiedliche Tabellen.

# database.tables_only_on_local
source: Following tables only exist on local:
de: Folgende Tabellen existieren nur lokal:

# database.tables_only_on_foreign
source: Following tables only exist on foreign:
de: Folgende Tabellen existieren nur in der entfernten Datenbank:

# database.field_differences
source: Field differences between your databases have been detected.
de: Es wurden Unterschiede in den Feldern der lokalen und entfernten Datenbank festgestellt.

# database.different_fields
source: These fields differ:
de: Diese Felder haben Unterschiede:

# database.different_tables
source: These tables differ:
de: Diese Tabellen haben Unterschiede:

# ssh_connection.full_availability
source: All required and optional PHP SSH2 functions are available.
de: Alle benötigten und optionalen PHP SSH2 Funktionen sind vorhanden.

# ssh_connection.functions_missing
source: PHP SSH functions are missing. Install the PHP ssh2 library.
de: PHP SSH Funktionen fehlen. Installieren Sie die php ssh2 Bibliothek.

# ssh_connection.chmod_missing
source: The function "ssh2_sftp_chmod" is missing. Permissions will be set on CLI level, but will not report any error!
de: Die Funktion "ssh2_sftp_chmod" fehlt. Die Dateiberechtigungen werden über Shell-Befehle gesetzt aber es gibt keine Fehlerbehandlung!

# ssh_connection.chmod_description
source: The function "ssh2_sftp_chmod" is available since php_ssh2 0.12. Either upgrade or ignore this message.
de: Die Funktion "ssh2_sftp_chmod" steht ab der Version 0.12 von php_ssh2 zu Verfügung. Upgraden Sie php_ssh2 oder ignorieren Sie diese Meldung.

# sftp_requirements.all_known_dependencies_okay
source: All known settings for the SFTP data transfer are correct.
de: Alle bekannten benötigten Einstellungen für den SFTP Dateitransfer sind korrekt.

# sftp_requirements.allow_url_fopen_disabled
source: The SFTP file transfer requires the php setting allow_url_fopen to be enabled.
de: Der SFTP Dateitransfer setzt voraus, dass die PHP-Einstellung allow_url_fopen aktiviert ist.

# ssh_connection.connection_successful
source: The SSH connection to the foreign host was successful and all options are correct.
de: Die SSH Verbindung auf das entfernte System war erfolgreich und alle Optionen sind korrekt.

# ssh_connection.connection_failed
source: The SSH connection to the foreign host failed.
de: Die SSH Verbindung zum entfernte System schlug fehl.

# ssh_connection.connection_failure_message
source: The following error was returned by the ssh connection:
de: Der folgende Fehler wurde von der SSH Verbindung gemeldet:

# ssh_connection.invalid_php
source: The path to php seems to be wrong (option: foreign.pathToPhp).
de: Der Pfad zu PHP stimmt möglicherweise nicht (Option: foreign.pathToPhp).

# ssh_connection.php_test_error_message
source: The test returned following error message:
de: Der Test hat folgende Fehlermeldung zurück gegeben:

# ssh_connection.foreign_document_root_wrong
source: The foreign document root could not be validated, because typical TYPO3 folders are missing (option: foreign.rootPath).
de: Das Webverzeichnis des entfernten Systems konnte nicht verifiziert werden, da typische TYPO3-Verzeichnisse fehlen (Option: foreign.rootPath).

# ssh_connection.foreign_document_root_missing
source: The foreign document root could not be validated, because the configured folder "%s" does not exist (option: foreign.rootPath).
de: Das Webverzeichnis des entfernten Systems konnte nicht verifiziert werden, da das konfigurierte Verzeichnis "%s" nicht existiert (Option: foreign.rootPath).

# ssh_connection.foreign_document_validation_error
source: Could not validate the foreign document root for other reasons.
de: Das Webverzeichnis des entfernten Systems konnte aus anderen Gründen nicht verifiziert werden.

# ssh_connection.foreign_document_validation_error_reason
source: The command returned following message:
de: Der Test hat folgende Fehlermeldung zurück gegeben:

# ssh_connection.wrong_context
source: The configured foreign TYPO3 context "%s" is invalid
de: Der für das entfernte System konfigurierte TYPO3 Kontext "%s" ist ungültig

# ssh_connection.dispatcher_unknown_error
source: Calling the remote CLI dispatcher resulted in an unknown error
de: Der Aufruf des entfernten Systems auf der Kommandozeile hat zu einem unbekannten Fehler geführt

# application.utf8_fs_errors
source: UTF8 file and folder names will break the publishing process, because special UTF8 characters are detected as malicious on the CLI.
de: UTF8 Datei- und Verzeichnisnamen führen zu Fehlern im Publizierungsprozess, da spezielle Zeichen als bösartige Zeichen auf dem CLI gelten.

# application.local_instance_validated
source: The local environment was validated successfully.
de: Die lokale Instanz wurde erfolgreich validiert.

# application.local_utf8_fs
source: UTF8 filesystem configured for the local system, please disable this configuration in Install tool.
de: Lokal ist UTF8 Dateisystem konfiguriert. Bitte deaktivieren sie diese Option im Install Tool.

# application.superfluous_excluded_tables_detected
source: Some tables in "excludeRelatedTables" do not exist in the local database.
de: Einige Tabellen aus der Option "excludeRelatedTables" existieren nicht in der lokalen Datenbank.

# application.superfluous_excluded_tables
source: Following tables are configured but do not exist:
de: Folgende Tabellen wurden konfiguriert, existieren aber nicht:

# application.site_configuration.valid
source: The site configuration seems to be valid and compatible on local and foreign.
de: Die Site Configuration scheint auf beiden Seiten gültig und identisch zu sein.

# application.site_configuration.invalid
source: The site configuration has significant differences between local and foreign.
de: Die Site Configuration hat signifikante Unterschiede zwischen den lokalen und entfernten TYPO3.

# application.local_sites_config_missing
source: One or more root pages are missing their site configuration.
de: Eine oder mehrere Startseiten haben keine Seitenkonfiguration.

# application.local_sites_config
source: All sites have been found to be configured via site configuration.
de: Alle Startseiten verfügen über eine gültige Site Configuration.

# application.no_local_sites_found
source: No root pages have been found.
de: Es wurden keine Startseiten gefunden.

# application.local_sites_query_error
source: An error occurred in the root site detection query.
de: Ein Fehler ist in der Startseiten-Suche aufgetreten.

# application.local_site_config_slash
source: At least one local root page has a site configuration without a full base domain.
de: Mindestens eine Startseite auf dem lokalen System hat eine Startseite ohne einer vollen Basis-Domain.

# application.local_site_config_exception
source: An unexpected exception occurred when searching for sites on Local.
de: Ein unerwarteter Fehler ist während der Sites-Suche auf Local aufgetreten.

# application.foreign_database_config.success
source: The database on foreign is configured correctly in the CLI context.
de: Die Datenbank auf dem entfernten System ist im Konsolenkontext korrekt konfiguriert.

# application.foreign_database_config.unexpected_error
source: An unexpected error occurred during the CLI context database configuration test.
de: Ein unerwarteter Fehler ist während des Konfigurationstest der Datenbank auf Konsolenebene aufgetreten.

# application.foreign_database_config.failure
source: The foreign database in2publish_core connects to and the database used on foreign are different.
de: Die entfernte Datenbank auf die sich in2publish_core verbindet ist nicht die gleiche Datenbank auf die sich das entfernte System verbindet.

# application.foreign_database_config.configuration_invalid
source: The database connection configured in the LocalConfiguration.yaml (or Config Wizard) differs from the actually used database connection on foreign. Please check the local configuration and that the foreign configuration is set independently of conditions or that these conditions are also true in the CLI context (e.g. the .htaccess file will not be evaluated in the CLI context).
de: Die lokal konfigurierten und auf dem entfernten System tatsächlich verwendeten Datenbankzugangsdaten unterscheiden sich. Bitte stellen Sie sicher, dass die in der LocalConfiguration.yaml (oder dem Konfigurationseditor) definierten Zugangsdaten korrekt sind und die auf dem entfernten System gesetzten Zugangsdaten unabhängig von einer Bedingung gesetzt wird oder diese Bedingung auf im Konsolenkontext zutrifft (z.B .htaccess wird nicht auf der Konsole ausgewertet).

# application.foreign_system_validated
source: The foreign environment was validated successfully.
de: Die entfernte Instanz wurde erfolgreich validiert.

# application.foreign_cli_lowlevel_user_missing
source: Could not call the CLI dispatcher on foreign because the backend user "_cli_lowlevel" is missing there.
de: Der CLI dispatcher konnte auf dem entfernten System nicht aufgerufen werden, da dort der Backend User "_cli_lowlevel" fehlt.

# application.foreign_cli_lowlevel_user_missing_message
source: The call to the dispatcher returned following error:
de: Der Aufruf des Dispatcher gab folgenden Fehler zurück:

# application.foreign_cli_dispatcher_not_callable
source: Could not call the CLI dispatcher on foreign because of an unexpected error.
de: Der CLI dispatcher konnte auf dem entfernten System aufgrund eines unbekannten Fehlers nicht aufgerufen werden.

# application.foreign_cli_dispatcher_wrong_path
source: Could not call the CLI dispatcher on foreign. Please configure "foreign.dispatcher" correctly.
de: Der CLI dispatcher konnte auf dem entfernten System nicht aufgerufen werden. Die Option "foreign.dispatcher" muss korrekt konfiguriert werden.

# application.foreign_cli_dispatcher_error_message
source: The call to the dispatcher returned following message:
de: Der Aufruf des Dispatcher gab folgenden Nachricht zurück:

# application.foreign_version_differs
source: The installed versions on the local and foreign system are different.
de: Auf dem lokalen und dem entfernten System sind unterschiedliche Versionen von in2publish installiert.

# application.foreign_version_not_detectable
source: The installed version of in2publish_core on the foreign system is not detectable.
de: Die installierte Version auf dem entfernten System konnte nicht erkannt werden.

# application.local_version
source: Local version:
de: Lokale Version:

# application.foreign_version
source: Foreign Version:
de: Entfernte Version:

# application.foreign_configuration_loading_state
source: The configuration utility has following loading state:
de: Das Konfigurationswerkzeug hat folgenden Ladestatus:

# application.foreign_utf8_fs
source: UTF8 filesystem configured for the foreign system, please disable this configuration in Install tool.
de: Auf dem entfernten System ist TYPO3 mit dem UTF8 Dateisystem konfiguriert. Bitte deaktivieren Sie diese Option im Install Tool.

# application.different_t3_versions
source: The TYPO3 versions of the local and the foreign instance differ.
de: Die TYPO3 Version der lokalen und entfernten Instanz ist unterschiedlich.

# application.local_t3_versions
source: Local TYPO3 Version:
de: Lokale TYPO3 Version:

# application.foreign_t3_versions
source: Foreign TYPO3 Version:
de: Entfernte TYPO3 Version:

# application.foreign_admin_mode
source: adminMode is set to "0" on the foreign system, which means anyone with an account can log in.
de: adminMode ist auf in der entfernten Instanz auf "0" gesetzt, daher kann sich jeder reguläre Benutzer einloggen..

# application.editor_login_possible
source: Since adminMode is not set to "2" it is possible for regular backend users to log in, if they have an account on foreign.
de: Da adminMode nicht auf "2" gesetzt ist, ist es normalen Backend-Benutzern möglich sich auf dem entfernten System einzuloggen, sofern sie dort einen benutzer haben.

# application.no_foreign_sites_found
source: No root pages have been found on the foreign system.
de: Es wurden keine Startseiten auf dem entfernten System gefunden.

# application.foreign_sites_query_error
source: An error occurred in the root site detection query.
de: Ein Fehler ist in der Startseiten-Suche aufgetreten

# application.foreign_site_config_error
source: An error occurred during site configuration detection.
de: Ein Fehler ist beim Auslesen der Seitenkonfiguration auf dem entfernten System aufgetreten.

# application.foreign_site_config_slash
source: At least one foreign root page has a site configuration without a full base domain.
de: Mindestens eine Startseite auf dem entfernten System hat eine Startseite ohne einer vollen Basis-Domain.

# application.foreign_sites_config_missing
source: One or more foreign root pages are missing site configurations.
de: Bei einer oder mehreren Startseiten des entfernten Systems fehlen Seitenkonfigurationen.

# application.foreign_sites_config
source: All foreign root pages have a site configuration.
de: Alle fremden Stammseiten des entfernten Systems verfügen über eine Site-Konfiguration.

# application.local_site_config_exception
source: An unexpected exception occurred when searching for sites on Foreign.
de: Ein unerwarteter Fehler ist während der Sites-Suche auf Foreign aufgetreten.

# fal.affected_storages
source: Affected Storages:
de: Betroffene FAL Storages:

# fal.no_missing_storages
source: No missing FAL storages.
de: Keine fehlenden FAL Storages gefunden.

# fal.missing_storages
source: Missing FAL storages detected.
de: Fehlenden FAL Storages gefunden.

# fal.missing_on_local
source: Storages missing on local:
de: Folgende FAL Storages fehlen lokal:

# fal.missing_on_foreign
source: Storages missing on foreign:
de: Folgende FAL Storages fehlen auf dem entfernten System:

# fal.case_sensitivity_matching
source: FAL storages case sensitivity checked.
de: Beachtung der Groß- Kleinschreibung in FAL Storages überprüft.

# fal.case_sensitivity_mismatch
source: Case sensitivity errors detected.
de: Probleme mit Beachtung der Groß- Kleinschreibung entdeckt.

# fal.default_storage.configured
source: A FAL storage has been marked as default.
de: Eine FAL-Storage wurde als Standard markiert.

# fal.default_storage.missing
source: The default storage could not be detected, because no file storage is marked as default.
de: Die Standard-FAL-Storage konnte nicht identifiziert werden, da keine als Standard markiert ist.

# fal.driver_matching
source: The FAL storages have identical drivers.
de: Alle FAL Storages haben identische Treiber.

# fal.driver_mismatch
source: Following FAL Storages have different drivers.
de: Folgende FAL Storages haben unterschiedliche Treiber:

# fal.driver_mismatch_explanation
source: The FAL driver on live will be changed by publishing. This might result in missing images in the frontend or data loss in worst case.
de: Unterschiedliche Treiber werden beim publishing überschrieben. Das kann zu fehlenden Bildern im Frontend führen oder gar zu Datenverlust.

# fal.xsp_driver_premium_notice
source: In this community version differences between FAL storages will be simply overwritten. Allowing different FAL drivers hence allowing Cross-Storage-Publishing (XSP) is an enterprise version feature.
de: In dieser Community Version werden unterschiede zwischen FAL Storages überschrieben. Cross-Storage-Publishing (XSP) ist ein Feature der Enterprise Version.

# fal.storage_targets_okay
source: All FAL storages have different file system targets.
de: Alle FAL Storages haben verschiedene Dateisysteme zum Ziel.

# fal.storage_targets_test_error
source: The unique storage target test failed.
de: Der Zieldateisystemtest schlug fehl.

# fal.storage_targets_test_skipped
source: The unique storage target has skipped one or more storages, because they are offline.
de: Der Zieldateisystemtest konnte nicht auf alle Storages angewendet werden, weil mindestens eine offline ist.

# fal.offline_storage_names
source: Following Storages are offline:
de: Folgende Storages sind offline:

# fal.foreign_offline_storages
source: Following Storages are offline only on foreign:
de: Folgende Storages sind auf dem entfernten System offline:

# fal.storage_targets_same
source: One or more storages on local have the same file system target as the corresponding storage on foreign.
de: Eine oder mehrere lokale FAL Storages haben das selbe Dateisystem zum Ziel wie die dazugehörige entfernte FAL Storage(s).

# fal.test_file_upload_failed
source: Could not upload a testfile to a FAL storage. Please assure write and read permissions on the storages root level folder.
de: Die Testdatei konnte nicht hochgeladen werden. Bitte stellen sie sicher, dass TYPO3 Schreib- und Leserechte im Startverzeichnis der FAL Storage hat.

# adapter.all_remote_adapter_tests__passed
source: All adapter tests for the RCE component have passed
de: Alle Adaptertests für die RCE-Komponente waren erfolgreich

# adapter.all_transmission_adapter_tests__passed
source: All adapter tests for the TATAPI component have passed
de: Alle Adaptertests für die TATAPI-Komponente waren erfolgreich

# adapter.adapter_selection.valid
source: The selected values for the adapter configuration are okay
de: Die Werte für die Adapterauswahl sind okay

# adapter.adapter_selection.missing_adapter_or_implementation
source: The configuration for following adapters is invalid or the adapter could not be loaded
de: Die Konfiguration für folgende adapter ist ungültig oder die Klasse konnte nicht geladen werden

# adapter.adapter_selection.config_error
source: The configuration for the adapters is missing. Please check the other tests and your configuration
de: Die Konfiguration für die Adapter fehlt. Bitte die anderen Tests beachten und die Konfiguration prüfen.

# performance.rce_init.init_time
source: The Remote Command Dispatcher initialization took %f seconds on average
de: Die Initialisierung des Remote Command Dispatcher benötigt im Schnitt %f Sekunden

# performance.rce_init.slow_help
source: A slow Remote Command Dispatcher initialization will degrade the overall execution speed of the Content Publisher. The initialization time depends on the connection speed and ping between your local and foreign instance, as well as the responsiveness of the foreign service that receives the request (e.g. the SSH Server or HTTP Adapter).
de: Eine langsame Initialisierung des Remote Command Dispatcher verschlechtert die Gesamtausführungsgeschwindigkeit des Content Publisher. Die Initialisierungszeit hängt von der Verbindungsgeschwindigkeit und dem Ping zwischen Ihrer lokalen und entfernten Instanz ab, sowie die Reaktionsfähigkeit des Dienstes auf foreign, der die Anforderung empfängt (z.B. der SSH-Server oder der HTTP-Adapter).

# performance.rce_init.xdebug_enabled
source: Xdebug is enabled, which can drastically impair the initialization speed. Please disable Xdebug and run this test again.
de: Xdebug ist aktiviert, was die Performance drastisch einschränken kann. Bitte deaktivieren sie Xdebug und starten Sie die Tests erneut.

# performance.db_init.init_time
source: The foreign database initialization took %d microseconds on average
de: Die Initialisierung der entfernten benötigt im Schnitt %d Mikrosekunden

# performance.db_init.slow_help
source: A slow database initialization will degrade the overall execution speed of the Content Publisher. The initialization time depends on the connection speed and ping between your local instance and foreign database server, as well as the responsiveness of the foreign database .
de: Eine langsame Initialisierung der Datenbankverbindung verschlechtert die Gesamtausführungsgeschwindigkeit des Content Publisher. Die Initialisierungszeit hängt von der Verbindungsgeschwindigkeit und dem Ping zwischen Ihrer lokalen Instanz und der entfernten Datenbank ab, sowie der Reaktionsfähigkeit der Datenbank.
