Repository: in2code-de/in2publish_core
Catalog: Resources/Private/Language/*.locallang.xlf
Languages: de

# record.reason.shortcut_record
source: The record "%s" is a target of the shortcut record "%s". The target must be published before the shortcut record can be published.
de: Der Datensatz "%s" ist ein Ziel des Verknüpfungsdatensatzes "%s". Das Ziel muss veröffentlicht werden, bevor der Verknüpfungsdatensatz veröffentlicht werden kann.
