Repository: in2code-de/in2publish_core
Catalog: Resources/Private/Language/*.locallang.xlf
Languages: de

# web_In2publishCoreM1
source: Publish Overview
de: Publisher Übersicht

# module_m1_title
source: publish pages and records overview
de: Übersicht Seiten und Datensätze veröffentlichen

# module_m3_title
source: Publish files
de: Dateien veröffentlichen

# module_m4_title
source: administration tools
de: Tools für Administratoren

# m1.page_recursion
source: Depth
de: Tiefe

# m1.page_recursion.depth
source: %d level
de: %d Ebene

# m1.page_recursion.depths
source: %d levels
de: %d Ebenen

# label_stage
source: Stage System
de: Redaktionssystem

# label_production
source: Production System
de: Produktivsystem

# record_published
source: The selected record has been published successfully. (Duration: %s)
de: Der ausgewählte Datensatz wurde erfolgreich veröffentlicht. (Dauer: %s)

# record_publishing_failure
source: One or more errors occurred during publishing. Please check the logs. (Duration: %s)
de: Ein oder mehrere Fehler traten während des Publizierungsvorgangs auf. Bitte prüfen Sie die Fehlerlogs. (Dauer: %s)

# relation_resolving_errors
source: One or more errors occurred during relation resolving. Please check the logs.
de: Ein oder mehrere Fehler traten auf während die Verknüpfungen aufgelöst wurden. Bitte prüfen Sie die Fehlerlogs.

# publish_failed
source: The selected record has been published successfully.
de: Der ausgewählte Datensatz wurde erfolgreich veröffentlicht.

# folder_created
source: The selected folder has been created successfully.
de: Der ausgewählte Ordner wurde erfolgreich angelegt.

# folder_creation_failed
source: The selected folder could not be created.
de: Der ausgewählte Ordner konnte nicht angelegt werden.

# folder_removed
source: The selected folder has been removed successfully.
de: Der ausgewählte Ordner wurde erfolgreich gelöscht.

# folder_removal_failed
source: The selected folder could not be removed.
de: Der ausgewählte Ordner konnte nicht gelöscht werden.

# folder_retrieving_failed
source: in2publish failed to retrieve information about the folder %s or any of it's sub folders. Please verify that is in2publish is working properly by running the tests.
de: in2publish konnte keine Informationen über den Ordner %s oder einen seiner Unterordner auslesen. Bitte überprüfen Sie ob in2publish korrekt eingerichtet ist, indem Sie die Tests durchführen.

# label_publish_all_pages
source: Publish page "%s" and its subpages.
de: Veröffentlichen der Seite "%s" und ihrer Unterseiten

# confirm_publish_all_pages
source: Do you really want to publish all pages?
de: Möchten Sie wirklich alle Seiten veröffentlichen?

# confirm_publish_pages
source: Do you really want to publish this page?
de: Möchten Sie diese Seite wirklich veröffentlichen?

source: Publish
de: Publizieren

# publish_pages
source: Publish this page
de: Diese Seite publizieren

# publishing_page
source: This page is currently being published
de: Diese Seite wird gerade veröffentlicht

# publishing_file
source: This file is currently being published
de: Diese Datei wird gerade veröffentlicht

# label_publish_all_files
source: Publish all files within folder "%s".
de: Veröffentlichen aller Dateien innerhalb von "%s"

# confirm_publish_all_files
source: Do you really want to publish all files?
de: Möchten Sie wirklich alle Dateien veröffentlichen?

# confirm_publish_file
source: Do you really want to publish this file?
de: Möchten Sie diese Datei wirklich veröffentlichen?

# dirty_properties_preview_page
source: Preview
de: Vorschau

# dirty_properties_preview_compare
source: Compare
de: Vergleichsansicht

# dirty_properties_history_page
source: History
de: Historie

# dirty_properties_preview_file
source: File preview
de: Dateivorschau

# dirty_properties_edit_main
source: Edit
de: Bearbeiten

# dirty_properties_pageproperties
source: %s properties
de: Eigenschaften von %s

# dirty_properties_fileproperties
source: Page properties
de: Seiteneigenschaften

# dirty_properties_undo
source: Record history
de: Datensatz Historie

# dirty_properties_edit
source: Edit record
de: Datensatz bearbeiten

source: Related Records
de: Verknüpfte Datensätze

source: Record State
de: Datensatz Status

# moduleselector.index
source: Introduction
de: Übersicht

# moduleselector.index.description
source: This tool just lists all other tools.
de: Dieses Tool listet nur alle anderen Tools auf

# moduleselector.configuration
source: Show configuration
de: Konfigurationsübersicht

# moduleselector.configuration.description
source: Display the local configuration of in2publish from LocalConfiguration.yaml
de: Zeige die aktuelle Konfiguration von in2publish von der LocalConfiguration.yaml Datei

# moduleselector.logs
source: Show logs
de: Logs anzeigen

# moduleselector.logs.description
source: Show all logs of the Content Publisher with plenty filter options
de: Zeigt die Logeinträge des Content Publishers mit vielen Filteroptionen an

# moduleselector.test.description
source: Run some function test of in2publish
de: Teste in2publish auf Funktionsfähigkeit

# moduleselector.tca
source: Inspect TCA
de: TCA inspection

# moduleselector.tca.description
source: See which parts of the TCA are processed, and the reason why others are not.
de: Zeige die Teile des TCA die verwendet werden und alle anderen mit der Begründung warum sie nicht verwendet werden.

# moduleselector.flush_envelopes
source: Remove superfluous envelopes
de: Überflüssige Envelopes löschen

# moduleselector.flush_envelopes.description
source: Deletes all envelopes (remote procedure call database entries) which were already used (envelopes are one-way records).
de: Löscht alle Envelopes ("Remote Procedure Call"-Datenbankeinträge) die bereits genutzt wurden (Diese sind Einweg-Einträge)

# moduleselector.flush_registry
source: Remove all Registry entries
de: Registereinträge löschen

# moduleselector.flush_registry.description
source: Removes all registry entries which store information about the local and foreign environment. You must run the test after flushing these.
de: Löscht alle Registereinträge, welche Informationen über das lokale und entfernte System vorhalten. Danach müssen die Tests erneut ausgeführt werden.

# moduleselector.system_info
source: System information
de: Systeminformationen

# moduleselector.system_info.description
source: Use this module to collect information which will be required or useful to solve a bug or problem.
de: Anzeige von Informationen welche erforderlich oder nützlich sind Probleme zu identifizieren und sie zu beheben.

# moduleselector.compare
source: Compare Databases
de: Datenbankvergleich

# moduleselector.compare.description
source: The compare tool scans the whole database for differences. This tool is ought to help administrators clean up UID conflicts.
de: Zeigt unterschiede zwischen den Datenbanken an. Dieses Tools soll Administratoren dabei helfen UID-Konflikte zu lösen.

# moduleselector.record_inspector
source: Inspect a record tree
de: RecordTree Untersuchen

# moduleselector.record_inspector.description
source: You can query for a record tree by classification and identifier and inspect it with all of its properties and children.
de: Hier kann ein RecordTree mittels Klassifikation und Identifikation aufgebaut und untersucht werden..

# system_info.show
source: Show the system info
de: Systeminformationen anzeigen

# system_info.download
source: Download the system info
de: Systeminformationen herunterladen

# system_info.decode
source: Decode the system info JSON
de: JSON dekodieren

# system_info.decode.json
source: JSON string
de: JSON Text

# system_info.decode.decode
source: Decode!
de: Dekodieren

# system_info.decode.json_error
source: Error during json decoding
de: Fehler während des dekodierens

# system_info.decode.json_error.details
source: JSON decode error #%d: %s
de: JSON dekodierfehler #%d: %s

# system_info.upload.file
source: SysInfo JSON file
de: Systeminformationen JSON Datei

# system_info.upload.upload
source: Upload!
de: Hochladen!

# record.filter
source: Filter by:
de: Filtern nach:

# record.filename
source: Filename
de: Dateiname

# record.state.unchanged
source: Record unchanged
de: Unverändert

# record.state.changed
source: Record changed
de: Datensatz geändert

# record.state.added
source: New record
de: Neuer Datensatz

# record.state.deleted
source: Record deleted
de: Gelöschter Datensatz

# record.state.moved
source: Record moved
de: Datensatz verschoben

# record.state.unchanged.short
source: Unchanged
de: Unverändert

# record.state.changed.short
source: Changed
de: Verändert

# record.state.added.short
source: New
de: Neu

# record.state.deleted.short
source: Deleted
de: Gelöscht

# record.state.moved.short
source: Moved
de: Verschoben

# record.state.moved-and-changed.short
source: Moved/Changed
de: Verschoben/Verändert

# module.m4.configuration
source: Configuration
de: Konfiguration

# module.m4.global_config
source: Global Configuration
de: Globale Konfiguration

# module.m4.personal_config
source: Personal Config
de: Persönliche Konfiguration

# module.m4.container_dump
source: Config Container Dump
de: Config Container Konfiguration

# module.m4.emulate_page
source: Enter Page ID for page specific configuration
de: Seiten-ID für Seitenspezifische konfiguration angeben

# module.m4.overview
source: Overview
de: Übersicht

# module.m4.tca
source: TCA inspection
de: TCA Inspizieren

# module.m4.tca.compatible
source: Compatible TCA
de: Kompatibles TCA

# module.m4.tca.incompatible
source: Incompatible TCA
de: Inkompatibles TCA

# module.m4.tca.navigate.to_incompatible
source: Navigate to incompatible TCA
de: Zu inkompatiblem TCA springen

# module.m4.tca.navigate.to_compatible
source: Navigate to compatible TCA
de: Zu kompatiblem TCA springen

# module.m4.tca.navigate.to_controls
source: Navigate to controls
de: Zu controls springen

# module.m4.registry_flushed
source: Flushed all related registry entries.
de: Alle zugehörigen Registereinträge wurden gelöscht.

# module.m4.superfluous_envelopes_flushed
source: Flushed all superfluous envelopes.
de: Alle überflüssigen Envelopes wurden gelöscht.

# module.m4.flush_envelopes
source: Flush superfluous envelopes.
de: Überflüssigen Envelopes löschen.

# module.m4.nothing_to_flush
source: There are no envelopes to flush.
de: Es gibt keine Envelopes zum löschen.

# module.m4.flush_registry
source: Clear registry entries.
de: Registry-Einträge löschen.

# module.m4.flush_registry.description
source: The Content Publisher stores various information in the registry, like the outcome of the last test run. You can force the removal of these entries here.
de: Der Content Publisher speichert Informationen wie das Ergebnis des letzten Testlaufs in der Registry. Sie können die Löschung dieser Einträge hier erzwingen.

# test_state_error
source: In2publish might not work as expected.
de: In2publish könnte vom erwarteten Verhalten abweichen.

# test_state_error.tests_never_ran
source: Unknown test state. Please execute the tests in the Publish Tools Module.
de: Unbekannter Teststatus. Bitte führen sie die Tests im Publish Tools Modul aus.

# test_state_error.tests_failing
source: Some In2publish tests are failing.
de: Einige Tests von in2publish schlagen fehl.

# test_state_error.environment_changed
source: Your TYPO3 installation changed.
de: Ihre TYPO3 Installation hat sich verändert.

# test_state_error.configuration_changed
source: The In2publish configuration has changed.
de: Die In2publish Konfiguration wurde verändert.

# frontend.compare.selection.alignment.vertical
source: Vertical
de: Vertikal

# file_publishing.success
source: Successful published.
de: Erfolgreich publiziert.

# file_publishing.failure
source: Something went wrong.
de: Ein Fehler ist aufgetreten.

# file_publishing.folder
source: The selected folder %s has been published to the foreign system.
de: Das Verzeichnis %s wurde erfolgreich publiziert.

# file_publishing.failure.folder
source: The selected folder %s could not be published.
de: Das Verzeichnis %s konnte nicht publiziert werden.

# file_publishing.file
source: The selected file %s has been published to the foreign system.
de: Die Datei %s wurde erfolgreich publiziert.

# file_publishing.failure.file
source: The selected file %s could not be fully published.
de: Die Datei %s konnte nicht vollständig publiziert werden.

# publishing.tasks_failure
source: One or more additional tasks which run after the successful publishing process failed. Caches and other non critical aspects might not behave as expected. The logs might contain more information.
de: Eine oder mehrere Aufgaben, die nach dem erfolgreichen publizieren ausgeführt werden sind fehlgeschlagen. Caches und andere nicht kritische Aspekte könnten sich nicht wie erwartet verhalten. Die Logs können weitere Informationen enthalten.

# adapter.remote.ssh
source: Secure, authenticated and encrypted command execution
de: Sichere, authentifizierte und verschlüsselte Befehlsausführung

# adapter.transmission.ssh
source: Secure, reliable and encrypted asset transmission
de: Sichere, zuverlässige und Verschlüsselte Dateiübertragung

# help.slack_channel
source: Ask the Community: We have a channel named #ext-in2publish in the official TYPO3 Slack: <a target="_blank" href="https://typo3.slack.com/archives/C2ULY79MZ">https://typo3.slack.com/archives/C2ULY79MZ</a>
de: Frag die Community: Wir haben einen Slack Channel #ext-in2publish im offiziellen TYPO3 Slack: <a target="_blank" href="https://typo3.slack.com/archives/C2ULY79MZ">https://typo3.slack.com/archives/C2ULY79MZ</a>

# help.github_issues
source: Official documentation for in2publish_core: <a target="_blank" href="https://github.com/in2code-de/in2publish_core/tree/master/Documentation">https://github.com/in2code-de/in2publish_core/tree/master/Documentation</a>
de: Offizielle Dokumentation von in2publish_core: <a target="_blank" href="https://github.com/in2code-de/in2publish_core/tree/master/Documentation">https://github.com/in2code-de/in2publish_core/tree/master/Documentation</a>

# context_menu_publish_entry.forbidden
source: You are not allowed to publish this page.
de: Sie dürfen diese Seite nicht veröffentlichen.

# context_menu_publish_entry.missing_page
source: No page parameter was transferred.
de: Es wurde keine Seiten-ID zum veröffentlichen übertragen.

# context_menu_publish_entry.page_published
source: The page "%s" has been published.
de: Die Seite "%s" wurde veröffentlicht.

# context_menu_publish_entry.publishing_error
source: Error during publishing of page "%s". Please check your logs.
de: Beim veröffentlichen der Seite "%s" ist ein Fehler aufgetreten. Weitere Informationen finden Sie in den Logs.

# context_menu_publish_entry.not_publishable
source: This record is not yet publishable.
de: Diese Seite ist noch nicht veröffentlichbar.

# tca.sys_redirect.columns.tx_in2publishcore_page_uid.label
source: Associated page
de: Verknüpfte Seite

# tca.sys_redirect.columns.tx_in2publishcore_foreign_site_id.label
source: Associated foreign Site
de: Verknüpfte Site des entfernten Systems

# tca.sys_redirect.columns.tx_in2publishcore_foreign_site_id.config.items.null
source: Use site from associated page
de: Site der verknüpften Seite benutzen

# tca.sys_redirect.palettes.tx_in2publishcore_association.label
source: Page/Site association
de: Seite/Site Verknüpfung

source: Save and publish
de: Speichern und veröffentlichen

source: Publish all selected
de: Gewählte veröffentlichen

# redirect.legend.status
source: Status icons explained
de: Status Legende

# redirect.legend.status.page_or_site_required
source: The redirect requires an associated page or site to be published
de: Dieser Redirect benötigt eine verknüpfte Seite oder Site um veröffentlicht werden zu können

# redirect.legend.status.page_not_published
source: The associated page is not published
de: Die verknüpfte Seite ist nicht publiziert.

# redirect.legend.status.unpublished_changes
source: This redirect has unpublished changes. Hover over the icon to get more information
de: Der Redirect hat unveröffentlichte Änderungen. Den Mauszeiger auf das Icon bewegen um mehr zu erfahren

# redirect.legend.status.published
source: This redirect is published
de: Dieser Redirect ist publiziert

# redirect.legend.actions
source: Action icons explained
de: Aktionen Legende

# redirect.legend.actions.publish
source: This redirect can be published. Click to publish.
de: Dieser Redorect kann publiziert werden. Klicken um zu publizieren.

# redirect.legend.actions.associate_site_and_publish
source: This redirect can be published with a manual site association. Click to assign a Site and publish.
de: Dieser Redirect kann mit einer manuellen Site-Verknüpfung veröffentlicht werden. Klicken um eine Site zu verknüpfen und zu publizieren.

# redirect.record.property
source: Property
de: Eigenschaft

# redirect.record.property.old
source: Old value
de: Alt

# redirect.record.property.new
source: New value
de: Neu

# redirect.record.source
source: Source
de: Quelle

# redirect.record.target
source: Target
de: Ziel

# redirect.record.actions
source: Actions
de: Aktionen

# redirect.status.missing_page_or_site
source: Missing associated page or site
de: Fehlende Seite oder Seitenkonfiguration

# redirect.status.page_not_published
source: The associated page [%d] "%s" is not published
de: Die verknüpfte Seite [%d] "%s" ist nicht publiziert

# redirect.status.published
source: This redirect is published
de: Dieser Redirect ist publiziert

# redirect.status.short.publishable
source: Ready for publishing
de: Bereit zur Veröffentlichung

# redirect.status.short.siteRequired
source: Missing page or site
de: Fehlende Seite oder Seitenkonfiguration

# redirect.status.short.requiresPagePublishing
source: Requires page publishing
de: Fehlende Veröffentlichung der Seite

# redirect.status.short.published
source: Published
de: Veröffentlicht

# filter.form.submit
source: Filter
de: Filtern

# filter.field.has_association
source: Association
de: Verknüpfung

# filter.field.has_association.present
source: Association present
de: Verknüpft

# filter.field.has_association.missing
source: Association missing
de: Verknüpfung fehlend

source: Refresh page
de: Seite neu laden

# compare_database.only_local
source: New
de: Neu

# compare_database.only_foreign
source: Deleted
de: Gelöscht

# compare_database.diff
source: Differences
de: Unterschiede

# compare_database.general
source: Generally
de: Generell

# compare_database.general.local_empty
source: The table is empty on Local
de: Die Tabelle is auf Local leer.

# compare_database.general.foreign_empty
source: The table is empty on Foreign
de: Die Tabelle is auf Foreign leer.

# compare_database.transfer
source: Transfer these changes to the foreign system
de: Übertrage diese Änderungen auf das entfernte System

# compare_database.no_differences
source: No differences were found in the data of the selected tables.
de: Es wurden keine Unterschiede in den Daten der gewählten Tabellen entdeckt.

# compare_database.select_tables
source: Select the tables to compare
de: Tabellen für den Vergleich auswählen

# compare_database.tables
source: Tables
de: Tabellen

# compare_database.compare
source: Compare
de: Vergleichen

# compare_database.transfer_notice.header
source: This is not publishing
de: Dies ist kein Publishing

# compare_database.transfer_notice
source: A transfer is not a publishing. Only the exact record that is selected is transferred. No relations to other records are resolved and no MM-records are displayed nor transferred. You should always prefer normal publishing to this feature. Use this feature only in an emergency and only if you are aware of all the consequences.
de: Ein Transfer ist kein Publishing. Es wird dabei nur exakt der Datensatz übertragen, der ausgewählt wird. Es werden keine Verknüpfungen zu anderen Datensätzen aufgelöst und es werden auch keine MM-Datensätze angezeigt oder übertragen. Sie sollten ein normales Publishing immer diesem Feature vorziehen. Nutzen Sie dieses Feature nur im Notfall und nur, wenn Sie sich aller Konsequenzen bewusst sind.

# compare_database.label
source: Record label
de: Datensatztitle

# compare_database.actions
source: Actions
de: Aktionen

# compare_database.transfer.error
source: Error
de: Fehler

# compare_database.transfer.success
source: Success
de: Erfolg

# compare_database.transfer.record_missing
source: The record which should be transferred does not exist anymore.
de: Der Datensatz der übertragen werden sollte existiert nicht mehr.

# compare_database.transfer.exists_on_foreign
source: The record which should be transferred should not exists on Foreign but it does. It was probably published in the meantime.
de: Der Datensatz der übertragen werden sollte sollte nicht auf Foreign existieren, jedoch ist er vorhanden. Möglicherweise wurde er in der Zwischenzeit veröffentlicht.

# compare_database.transfer.exists_on_local
source: The record which should be transferred should not exists on Local but it does. It was probably created in the meantime.
de: Der Datensatz der übertragen werden sollte sollte nicht auf Local existieren, jedoch ist er vorhanden. Möglicherweise wurde er in der Zwischenzeit erstellt.

# compare_database.transfer.does_not_exists_on_both
source: The record which should be transferred should exists on both Local and Foreign but it does not. Please reload the comparison view and try again.
de: Der Datensatz der übertragen werden sollte sollte auf Local und Foreign existieren, er fehlt jedoch auf mindestens einem System. Bitte versuchen Sie es noch einmal, nachdem Sie die Vergleichsansicht neu geladen haben.

# compare_database.transfer.deleted_from_foreign
source: The record %s[%d] was deleted from foreign.
de: Der Datensatz %s[%d] wurde auf Foreign gelöscht.

# compare_database.transfer.transferred_to_foreign
source: The record %s[%d] was created on foreign.
de: Der Datensatz %s[%d] wurde auf Foreign erstellt.

# compare_database.transfer.updated_on_foreign
source: The record %s[%d] was updated on foreign.
de: Der Datensatz %s[%d] wurde auf Foreign aktualisiert.

# module_m3_index_content
source: Admin tools
de: Administrationswerkzeuge

# record.reason.requires_translation_parent.existing
source: "%s" requires that the record "%s" (which is the default language version) is published first.
de: "%s" erfordert, dass der Datensatz "%s" (das ist die Standardsprachversion) zuerst veröffentlicht wird.

# record.reason.requires_translation_parent.enablecolumns
source: "%s" requires that the record "%s" (which is the default language version) has all of its properties published (%s) which determine if the record is visible.
de: "%s" erfordert, dass der Datensatz "%s" (das ist die Standardsprachversion) alle seine Eigenschaften veröffentlicht hat (%s), die bestimmen, ob der Datensatz sichtbar ist.

# record.reason.requires_published_page.existing
source: "%s" requires that the page "%s" is published first.
de: "%s" erfordert, dass die Seite "%s" zuerst veröffentlicht wird.

# record.reason.requires_published_page.enablecolumns
source: "%s" requires that the page "%s" has all of its properties published (%s) which determine if the record is visible.
de: "%s" setzt voraus, dass die Seite "%s" alle seine Eigenschaften veröffentlicht hat (%s), die bestimmen, ob der Datensatz sichtbar ist.

# record.reason.missing_dependency
source: The record with classification "%s" and properties "%s" does not exist.
de: Der Datensatz mit der klassifizierung "%s" und Eigenschaften "%s" existiert nicht.
