Repository: in2code-de/in2publish_core
Catalog: Resources/Private/Language/*.locallang.testing.xlf
Languages: de

# performance.db_init.xdebug_enabled
source: Xdebug is enabled, which can drastically impair the initialization speed. Please disable Xdebug and run this test again.
de: Xdebug ist aktiviert, was die Performance drastisch einschränken kann. Bitte deaktivieren sie Xdebug und starten Sie die Tests erneut.

# performance.fs_io.rw_time
source: Reading and writing 10 MB took %f microseconds.
de: Das Lesen und Schreiben von 10 MB hat %f mikrosekunden gedauert.

# performance.fs_io.slow_help
source: A slow file system will degrade the overall execution speed of the Content Publisher. The file system speed depends on your hardware, drivers, actual storage location, disk health and more. You should persist your websites and assets on healthy SSD storage which is physically as well as logically close to the web server.
de: Eine langsame Initialisierung der Dateisystem verschlechtert die Gesamtausführungsgeschwindigkeit des Content Publisher. Die Geschwindigkeit des Dateisystems hängt von Ihrer Hardware, den Treibern, dem tatsächlichen Speicherort, dem Festplattenzustand und vielem mehr ab. Sie sollten Ihre Websites und Assets auf einem fehlerfreien SSD-Speicher speichern, der sowohl physisch als auch logisch nahe am Webservers liegt.

# performance.fs_io.xdebug_enabled
source: Xdebug is enabled, which can drastically impair the test results. Please disable Xdebug and run this test again.
de: Xdebug ist aktiviert, was die Testergebnisse drastisch beeinflussen kann. Bitte deaktivieren sie Xdebug und starten Sie die Tests erneut.
